package org.example.week03.day10;

public class B7562 {
    /*
    * 0. 문제 설명 : 체스판 위에 놓여있는 한 나이트가 특정 칸으로 이동하려면,
    *    최소 몇 번만에 이동할 수 있는지 출력한다.
    *    그림에 이동 규칙이 있는데 직선 2칸 간 후에 왼쪽 혹은 오른쪽으로 한 칸 꺾는다.
    * 1. 풀이 설계 : 입력의 첫째 줄에는 테스트 케이스의 개수가 주어진다.
    *    각 테스트 케이스틑 세 줄로 이루어져 있다.
    *    첫째 줄 : 체스판의 한 변의 길이(체스판은 정사각형이다.)가 입력된다.
    *    둘째, 셋째 줄 : 나이트가 현재 있는 칸, 나이트가 이동하려고 하는 칸이 입력된다.
    *    체스판의 각 칸은 두 수의 쌍 {0, ..., l-1} × {0, ..., l-1}로 나타낼 수 있다.
    *
    * */
    public static void main(String[] args) {

    }
}
