package org.example.week04.day14;

public class B2565 {
    /*
    ***** 문제 설명 : 전깃줄
    *     두 전봇대 A와 B 사이에 전깃줄을 추가하다 보니 전깃줄이 서로 교차하는 경우가 발생했다.
    *     합선의 위험이 있어서 이들 중 몇 개의 전깃줄을 없애 전깃줄이 교차하지 않도록 만들고자 한다.
    *     전깃줄이 전봇대에 연결되는 위치는 전봇대 위에서부처 차례대로 번호가 매겨진다.
    *     전깃줄의 개수와 전깃줄들이 두 전봇대에 연결되는 위치의 번호가 주어질 때,
    *     남아있는 모든 전깃줄이 서로 교차하지 않게 하기 위해 없애야 하는 전깃줄의 최소 갯수를 구한다.
    *
    ***** 입출력 : 첫째 줄에는 두 전봇대 사이의 전깃줄 갯수가 입력된다. (100이하의 자연수)
    *     둘째 줄부터 한 줄에 하나씩 전깃줄이 A전봇대와 연결되는 위치의 번호와
    *     B 전봇대와 연결되는 위치의 번호가 차례로 입력된다.
    *     위치의 번호는 500 이하의 자연수이고, 같은 위치에 두 개 이상의 전깃줄이 연결될 수 없다.
    *     이 때, 첫째 줄에 남아있는 모든 전깃줄이 서로 교차하지 않게 하기 위해
    *     없애야 하는 전깃줄의 최소 갯수를 출력한다.
    *
    ***** 풀이 설계 :
    *
    * */

    public static void main(String[] args) {

    }
}
